[["/8-2019", "Introduktion till rättsordningen"], ["“Det beror på”- juristsvar", "hela sanningen finns inte i lagtexten. "], ["Rättsordningen", "hur man organiserar ett rättssystem i ett land, rättsskipningen osv. Ett lands alla rättsregler, dvs. lagar och andra bestämmelser som alla måste följa. "], ["Rättssystem", "Detsamma som rättsordning."], ["Rättskipning", "Den dömande verksamhet som samhället, genom domstolarna utövar. Domstolarnas huvuduppgift."], ["Regeringsformen", "All offentlig makt utgår från folket och riksdagen är folkets främsta företrädare. Makten ska utövas under lagarna. "], ["Lagboken", "Alla lagar finns inte i lagboken, där finns dock central lagstiftning. Den blå boken utgår från balksystemet."], ["Granska rätten kritiskt", "en central del i en jurists arbete."], ["Offentlig rätt: Stat ⇆ Enskild", "Civilrätt/privaträtt: Enskild ⇆ Enskild", "Folkrätt: Stat ⇆ Stat"], ["Tredje man", "Den person, fysisk eller juridisk, som utan att vara part berörs av en rättshandling eller tvist. Står alltså utanför eventuellt avtal. Ex: bank"], ["Sakrätt", "Juridisk term som innefattar ett rättsförhållande eller ett avtalsförhållande som berör tredje man. Tre huvudtyper: äganderätt, säkerhetsrätt och bruksrätt. Sakrättsliga regler handlar om förhållandet till tredje man."], ["Rättsregel", "rättsfakta + rättsföljd (hur de är upplagda; OM rättsfaktum SÅ rättsföljd). En juridiskt bindande regel som lämnar anvisningar för mänskligt handlande. Hör till det juridiska normsystemet."], ["Etik och moral, kulturell och religiös “påverkan”. Lagar inte alltid i harmoni med normer (sociala kontexten). Ex", "fildelning."], ["Rättskälla", "De skrivna och oskrivna källor som anger rättssystemets uppbyggnad."], ["“Juridiskt isberg”", ""], ["Det som syns ovanför ytan: Lagarna. ", "Under ytan: 1. Förarbetet: Den viktigaste rättskällan, förutom lagarna.", "2. Praxis: domstolsavgörande, hur reglerna faktiskt tillämpas", "3. Doktrin: rättsvetenskaplig litteratur    ", "4. Sedvana: som man brukar göra."], ["Olika typer av domstolar", ""], ["Allmänna: Tingsrätt, Hovrätt och Högsta domstolen.", "Förvaltnings: Förvaltningsrätten, Kammarrätten och Högsta förvaltningsrätten.", "Specialdomstolar: Migrationsdomstolen, Miljödomstolen, Patent- och marknadsdomstolen, Arbetsdomstolen.", "EU-domstolen."], ["Sammanfattning", ""], ["Skapandet av lagar: skapandet av bilar i en fabrik:", "Riksdagen tillverkar dem.", "Regeringen kör dem.", "Domstolen lagar dem.", "Förstå en lag rättsligt - rättslig relevans."], ["Associationsrätt", "Berör associationer, bolag och föreningar. En association kan vara en enskild juridisk person. En förening eller enskild firma räknas däremot inte som en association, de inte har medlemmar eller delägare. "], ["Komparativ rätt", "En undersökning mellan minst två undersökningsobjekt av juridisk karaktär. Jämföra olika juridiska system."], ["Komparatist", "Ägnar sig åt jämförelse"], ["Landmark case", "Ett fall av historisk, och samtida, betydelse."], ["/8-2019", "Kursintroduktion T1"], ["Konstitutionell rätt", ""], ["9-2019", "Rättskällehierarkin"], ["(1-6", "Ju högre nummer, desto lägre ner i hierarkin.)"], ["1. Lagen: ", "Grundlagen", "Lagar - Riksdagen", "Förordningar - Regeringen", "Föreskrifter - Myndigheter"], ["2. Förarbeten:", "Det som föregått lagen - Utredning osv.", "Visar vad lagstiftare har menat och tänkt."], ["3. Praxis: ", "Avgöranden i domstolar", "De årtal som står efter lagarna i lagboken åsyftar just domar, praxis."], ["4. Doktrin:", "Forskning, “böcker”"], ["5. Sedvana: ", "“Som man brukar göra”", "Företag och avtal"], ["6. Handelsbruk:", "Lite tydligare än “Sedvana”, annars likt. "], ["1-6", "Den vanligaste hierarkin. Dock, inom exempelvis arbetsrätt, väger kollektivavtalen tungt, och kan därmed behandlas ungefär som lag. "], ["SFS", "Svensk författarsamling"], ["EU-rätt", "Befinner sig ovanför, liknelse med moln."], ["AMM", "Finns inte i lagboken."], ["Hänvisning till lagtext:", "Var konsekvent.", "Balk, kapitel: paragraft: stycke: mening", "Ex: MB 33: 1"], ["Förkortningar:", "AvtL: Avtalslagen", "MB: Miljöbalken", "KöpL: Köplagen", "RF: Regeringsförordningen"], ["9-2019", "Allmänt om avtal och rätthandlingar"], ["Avtalet som instrument i samhällslivet:", "Avtal = kontrakt", "Kortvarigt - Momentant", "Långvarigt - Varaktigt", "Mellanhavanden - Rättsförhållande, en rättslig relation", "Ett uttryck för autonomi"], ["Avtalsreglering", "Karaktäristiskt för ett liberalt samhällsskick - marknadsekonomi, avtalsfrihet (friheten att själv få bestämma vem man vill ingå avtal med, och villkor), äganderätt och fri konkurrens."], ["Avtalsfrihet: ", "Inte en obegränsad frihet", "Kontraheringsplikt - Skyldighet att ingå avtal. Ex: parkering", "Kontraheringsförbud - Förbud att ingå avtal. Ex: konkurrensrättsliga. "], ["Uttrycksmedel för avtal: ", "Ordet är viktigast", "Gester, uppträdande och handlingar: Realhandlingar"], ["Handlingsföreskrifter", "De handlingar parterna förpliktar sig att genomföra. "], ["Avtalets bindande och reglerande funktioner:", "Dess främsta funktion är att binda parterna, partbindningsfunktion, och att det anger vilka som är parter.", "Regleringsfunktion - genom handlingsföreskrifter regleras parternas mellanhavanden. ", "Garanterande av ömsesidighet, frivillighet och samverkan mellan parterna.", "Innebär frihet och skyldigheter.  "], ["Skiljedomsförfarande och skiljeavtal/klausul", "ett inslag i kommersiella avtal där parterna avtalar att framtida tvister ska lösas på annat sätt än genom prövning i allmän domstol."], ["Diktat", "Påbud, befallning, order"], ["Avtals-  och lagreglering: ", "Avtalsreglering: ett instrument för autonom reglering.", "Lagreglering: a) tvingande b) dispositiv - tillåten att avvika från"], ["Avtalstyper", "Tvåsida och ensidiga (testamenten)"], ["Avtal: ", "Anbud och accept", "Har syftet att grundlägga, förändra eller upphäva ett rättsförhållande."], ["Rättshandling: rättsliga förklaringar eller handlingar som medför rättsliga konsekvenser.", "Påbud: flertalet rättshandlingar"], ["Tradering", "överlämning vid köp"], ["Fullmakt", "att ge en annan person makt eller kompetens att rättshandla för fullmaktgivarens räkning. Fullmaktsgivaren ger, fullmäktige tar."], ["9-2019", "Introduktion till avtal och köprätt"], ["Avtal:", "En överrenskommelse, innehåller handslingsföreskrifter - vad man får och inte får göra. ", "Kan verkställas - Kronofogdemyndigheten"], ["Regler om avtal (avtalsrätt):", "Allmän AR: ingående av avtal, tolkning", "Speciell AR: Olika avtalstyper."], ["Tre grundprinciper: ", "1. Avtalsfriheten", "2. Avtalsbundenhet", "3. Avtal binder endast parter"], ["Pactum Turpe", "avtal som rör brottslig eller omoraliskt syfte, förtjänar inte rättsordningens skydd."], ["Det offentliga har en skyldighet att ingå, om det inte finns en bra förklaring till det motsatta. Ex: bussexempel.", "Diskrimineringsgrunder"], ["AR:s övergripande struktur:", "1915:218 Avtalslagen", "Speciallagstiftning för särskilda avtalstyper. Ex: köpeavtal, hyresavtal och anställningsavtal."], ["AR:s grundproblem: ", "1. Hur har ett avtal uppkommit?", "2. Vad innebär avtalet?", "3. Är det bindande?", "4. Har ett avtalsbrott skett?", "5. Om ett avtalsbrott har skett, vilka påföljder är då aktuella?"], ["Avtal kan vara dispositiva åt vissa håll. Ex", "Garantier."], ["Köpet - en avtalstyp:", "Syftar till att överföra äganderätten", "Påföljder vid fel på varan finns i felkatalogen §30"], ["9-2019", "Introduktion till straffrätten"], ["Brottsbalken:", "3 avdelningar: 1. Allmänna bestämmelser 2. Brotten ca 200st, 3. Påföljder"], ["Specialstraffrätten:", "Trafikbrott", "Narkotikabrott"], ["Allmänprevention: bilda en slags folkmoral genom symbolik", "Individualprevention: Hur man kan hjälpa en enskild individ att inte fortsätta vara kriminell. Ex: Sitta inne, dödsstraff."], [" Legalitetsprincipen: ", "Förbud mot analog strafftillämpning: en kan inte dömas för “ungefär” något den gjort, utan döms exakt.", "Förbud mot retroaktiv strafftillämpning."], ["Retroaktivitet och preskription:", "Åtal mot svenska soldater i Tyskland", "Undantag för preskription: Palmemordet, våldtäkt i  Billdal."], ["Oskyldighetspresumtionen:", "Behöver inte visa att man är oskylig.", "Förklaringsbörda kan dock läggas på den tilltalade."], ["Brottens uppbyggnad:", "Rättsregler innehåller rekvisit - villkor för att klassas som det brottet. Ex: “berövar annan livet”...döms för mord.", "I regel aktiva handlingar, men också underlåtanden. Ex: skattebrott"], ["Garantläran:", "Vissa personer befinner sig i garantrelation. Ex: Förälder - Barn; skyldighet att någon inte kan ta skada."], ["Äkta- och oäkta underlåtenhetsbrott:", "Äkta underlåtenhetsbrott: Brott där det uttryckligen anges att det är underlåtenheten, inte en gärning, som är straffbar. Brottsbeskrivningen är formulerad som en underlåtenhet. Alltså inte följt ett påbud.", "Oäkta underlåtenhetsbrott: Att man genom att inte utföra en handling som av lag krävs begår ett brott. Ex: förskingring"], ["Rättsfakta", "Rekvisit"], ["Åklagarens uppgift: ", "Matcha rekvisiten med den yttre verkligheten.", "Händelseförloppet -  rättsfakta", "Gärningsbeskrivning: var, när och hur. Konkretisera rättfaktan.", "Får inte döma/dömas än vad någon är åtalad för. Domstolen är dock inte bunden av åklagarens rubricering."], ["Rättsverkan inom straffrätten: påföljd", "Andra rättsverkan: Skadestånd, utvisning, förverkande."], ["Överklagande", "annars vinner domen laga kraft."], ["Resande", "Ta upp ett fall igen"], ["Rättskraft", "Tidigare domars betydelse i senare rättegångar."], ["Äldre lagtext - Kausistisk:", "Konkreta exempel → påföljder"], ["Uppsåt", "Motiv"], ["Påföljder inom straffrätten:", "Brottsbalkens påföljder är relativt bestämda", "Gradindelade brott → Luft i straffskalor"], ["Ungdomsrabatten:", "Under 21 år, livstids fängelse inte heller en möjlighet (max 14 års fängelse)", "Straffnedsättning procentuellt större desto yngre en är. → Ex: 15 år - ⅕ av det ursprungliga , 20 år - ¾ av det ursprungliga."], ["Ansvarsfrihetsgrunder:", "Att en straffbar handling under vissa förutsättningar inte utgör något brott", "Dödligt nödvärn, ett handlingsalternativ?"], ["9-2019", "Dom Mora tingsrätt"], ["Vad ingår i en dom:", "Parter och dess ombud", "Domslut", "Bakgrund: En sammanfattning vad som hänt, relation mellan parterna i målet och de ser på varandras handlande. Ofta beskrivs även händelseförloppet också inom brottsmål.", "Yrkanden: Den klagande parten, käranden i tvistemål eller åklagare i brottsmål anger vad denne vill att domstolen ska besluta om.", "Grunder: Domstolen anger vad parterna grundat sina argument på, varför de anser sig ha rätt.", "Sakframställningar: Det som kommit fram i förundersökningen.", "Domskäl: Domstolens motivering till sina beslut, tar i itu med rättsfrågorna och bevisfrågorna."], ["9-2019", "Avtalsrättsliga grundprinciper (det som inte står ovan)"], ["Undantag för avtalfriheten: ", "Inte binda TM ", "Inte ingå avtal med barn  "], ["Pacta sunt servanda", "“avtal ska hållas”"], ["Löftesprincipen (§1 AvtL):", "Du är bunden av ditt anbud eller accept"], ["Acceptfrist: den tid under vilken anbudstagaren måste avge sin accept för att ett avtal ska uppstå.", "Konventionell acc.frist: §2 AvtL", "Legal acc.frist: §3 AvtL “skälig betänketid, om inte viss tid anges”"], ["Avtalslagen:", "Dispositiv lag", "Fyller ut där avtal slutar", "Okej att återkalla sitt anbud eller accept innan eller samtidigt som andra part tar del av det.", "Skillnad mellan “tar del av” och “tillhanda”: “tar del av”=läser, “tillhanda”=att det finns tillgängligt. Ex: Mail.", "Avslag - inget avtal.", "Ren accept - avtal kommer till stånd", "Oren accept - (med modifikation), avslag i förening med nytt anbud. Enligt §6 kap. 1. AvtL.", "Sen accept - nytt anbud (inget anbud finns kvar), enligt §4 kap. 1. AvtL. UT; om anbudstagaren är i god tro om att svaret skulle komma i tid. Enligt st. 2. §4 kap. 1 AvtL. Vill anbudsgivaren reklamera måste; a) Tagaren vara i god tro. b) Givaren måste inse detta för sedan inte bli bunden av avtal.", "Muntliga avtal: måste antas direkt. (Dispositiv till fördel för konsumenten)", "Konkludent handlande: handlande som innebär att ett avtal anses slutit, trots att ett formellt sådant inte slutits. Ex: gå på en buss eller parkera en bil på parkeringsplats som kräver betalning.", "Ställningsfullmakt: en persons ställning utåt kan utgöra rätt till att företräda någon. §10 2st AvtL. Fullmakten anger behörighet och befogenhet. Behörighet framgår av lag eller sedvänja, vad man kan göra. Agerar någon utanför sin behörighet - inget avtal. Utanför befogenhet - inget avtal om TM handlat i ond tro. "], ["9-2019", "Ta sig an problem"], ["Rättsregler: (juridiskt bindande regler som lämnar anvisningar för mänskligt handlande)", "Rekvisit - vilken/vilka som stämmer överens med verkligheten"], ["Metod:", "1. Identifiera eventuell given rättsföljd / Identifiera rättsföljd", "2. Händelseförloppet", "3. Rättsregel som kan leda till önskad rättsföljd.", "4. Jämför rekvisit i aktuella rättsregler med rättsfakta i händelseförloppet."], ["Juridisk metod:", "Problemet: Identifiera det juridiska problemet.", "Reglerna: Identifiera de relevanta juridiska reglerna.", "Bedöm: Bedöm om reglerna är tillämpliga på det juridiska problemet i fråga.", "Rättsföljd: Konstatera rättföljderna av att reglerna är och inte är tillämpliga på problemet."], ["Plugga på olika ställen", "UB, AF-borgen, SOL, LUX, Eden."], ["Juridisk metod", "idealsvaret"], ["9-2019", "Egen genomgång av presentationen “Introduktion till straffrätten”"], ["Straffvärde och straffmätning:", "Skada, kränkning eller fara som handlingen inneburit.", "Högt straffvärde: Skäl för fängelse och vice versa.", "Brottsbalken räknar upp omständigheter som höjer respektive sänker straffvärdet. Kap. 29 §2 Försvårande och §3 förmildrande omständigheter. Övriga omständigheter som påverkar straffmätningen §5.", "Straffmätning: bestämning av straff i det enskilda fallet."]]